load_test.yml
config:
  target: "https://reqres.in/"
  phases:
    - duration: 1800
      arrivalRate: 2
      name: User add load test
  plugins:
      ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 600"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}api/users/2"
      - post:
          url: "{{ target }}api/users"
          json:
            name: "Mario"
            job: "Plumber"
          capture:
            - json: "$.name"
              as: "name"
            - json: "$.job"
              as: "job"
            - json: "$.id"
              as: "id"
            - json: "$.createdAt"
              as: "createdAt"
      - log: "{{name}},{{job}},{{id}},{{createdAt}}"